#+TITLE: Code Example: LU Decomposition in SYCL
#+Author: Finlay Marno
#+LATEX_HEADER: \makeatletter \@ifpackageloaded{geometry}{\geometry{margin=2cm}}{\usepackage[margin=2cm]{geometry}} \makeatother

** Performance - Part 1
   After the first implementation of SYCL LU factorisation, I tried a few different changes in an attempt to improve performance, which yeilded these time:

   | Run                 | warmup |     1 |     2 |     3 |     4 |  mean |
   |---------------------+--------+-------+-------+-------+-------+-------|
   | /                   |      < |     < |       |       |       |       |
   | Basic Gaussian      |   0.38 |  0.39 |  0.38 |  0.37 |  0.37 |  0.38 |
   | Gaussian LU         |   0.39 |  0.38 |  0.39 |  0.39 |  0.39 |  0.39 |
   | Original SYCL       |  23.76 | 31.26 | 30.85 | 30.60 | 30.40 | 30.78 |
   | Upfront Bufffers    |  17.43 | 21.15 | 21.07 | 20.46 | 20.75 | 20.86 |
   | Shared Queue        |  19.35 | 29.16 | 28.52 | 28.47 | 28.38 | 28.63 |
   | In-Order Queue      |  21.59 | 30.57 | 30.37 | 30.72 | 31.37 | 30.76 |
   | All except In-Order |  12.46 | 20.25 | 19.50 | 19.90 | 19.52 | 19.79 |
   | All                 |  10.87 | 19.16 | 18.87 | 18.71 | 18.60 | 18.83 |
   #+TBLFM: $7=vmean($3..$6)
      
   Where each time represents solving 10 circuits with roughly 100 nodes and 300 branches.
   Following is an explaination of the different changes made.
   Each of the following changes were done on seperate branches, then put together in the end.

** Performance - Part 2

   Looking at an analysis of CPU usage during the run, a single CPU seemed to be working throughout the simulation.
   My next guess to improve the performance was to try to use fewer, larger kernels, to save work submitting the kernels.
   Unfortunately, many of the steps depended on the result of the previous step, and since there is no `global barrier' the only solution is to submit a new kernel.
    
   Something that can be done in fewer steps is the reduction computation.
   In the forward and back propagation there is a sum function, and in the LU decomposition there is something like a =std::max_element=.
   Each of the functions instructs each work-item to reduce =n= values from an input buffer and put the result in an output buffer, then the kernel is run again but the input and output buffers have swapped roles.
   A list of m operations would be reduced to a single value in $log_n{m}$ kernel executions, so a greater n would lead to fewer kernel submissions.
    
   Following is a table of the results of that experiment. =n= went up then down again to try to avoid the affects of thermal throttling.
 
   | reduction per work-item | run 1 | run 2 | run 3 | run 4 | run 5 |   mean |
   |-------------------------+-------+-------+-------+-------+-------+--------|
   |                       / |     < |       |       |       |       |      < |
   |           warm up     2 | 14.31 | 17.42 | 17.60 | 17.66 | 17.12 | 16.822 |
   |                       2 | 16.66 | 16.93 | 16.69 | 16.62 | 16.68 | 16.716 |
   |                       4 | 12.02 | 11.94 | 11.92 | 12.10 | 12.03 | 12.002 |
   |                       8 | 10.16 | 12.71 | 11.52 | 11.16 | 11.15 |  11.34 |
   |                      16 | 10.19 | 10.31 | 10.31 | 10.25 | 10.28 | 10.268 |
   |                      32 |  8.74 |  8.80 |  9.00 |  8.85 |  8.86 |   8.85 |
   |                      64 |  8.71 |  8.66 |  9.01 |  8.76 |  8.73 |  8.774 |
   |                     128 |  8.64 |  8.65 |  8.69 |  8.60 |  8.61 |  8.638 |
   |                     128 |  8.60 |  8.62 |  8.73 |  8.42 |  8.15 |  8.504 |
   |                      64 |  8.18 |  8.22 |  8.21 |  8.14 |  8.25 |    8.2 |
   |                      32 |  8.22 |  8.15 |  8.17 |  8.24 |  8.23 |  8.202 |
   |                      16 |  9.50 |  9.57 |  9.62 |  9.53 |  9.57 |  9.558 |
   |                       8 | 10.37 | 10.28 | 10.20 | 10.31 | 10.32 | 10.296 |
   |                       4 | 12.22 | 12.08 | 12.05 | 13.90 | 13.35 |  12.72 |
   |                       2 | 19.54 | 19.61 | 19.57 | 19.54 | 19.44 |  19.54 |
   #+TBLFM: $7=vmean($2..$6)   

   The returns greatly diminish after 32, but it is still a great performance boost!
   In the future, run time could possibly be reduced further using atomics or the built-in SYCL reduce feature.
